Revit 2027 API
RebarShapeConstraintAngleFromFixedDir.Sign Property
 When the sign is 1, the Direction is rotated clockwise by the angle's value. When -1, the Direction is rotated counter-clockwise.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Sign { get; set; }
Public Property Sign As Integer
	Get
	Set
public:
property int Sign {
	int get ();
	void set (int value);
}
member Sign : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentException |  When setting this property: sign is not 1 or -1.
See Also
Reference
RebarShapeConstraintAngleFromFixedDir Class
Autodesk.Revit.DB.Structure Namespace